RPA/Files/GLWiseTransaction/GLWiseTransaction.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:pub="http://xmlns.oracle.com/oxp/service/PublicReportService">
   <soap:Header/>
   <soap:Body>
      <pub:runReport>
         <pub:reportRequest>
            <pub:attributeFormat>xml</pub:attributeFormat>
<!-- Flatten XML should always be false when we have XML type of output to display the XML tags as mentioned in BIP Data Model and display XML structure in as expected format -->
            <pub:flattenXML>false</pub:flattenXML>
            <pub:parameterNameValues>
 <!--1st Parameter of BIP Report-->
                  <pub:item>
                  <pub:name>P_ENTITY</pub:name>
                  <pub:values>
                      <pub:item>103</pub:item>
                  </pub:values>
                  </pub:item>
 <!--2ns Parameter of BIP Report-->
                  <pub:item>
                  <pub:name>P_ACCOUNT</pub:name>
                  <pub:values>
                      <pub:item></pub:item>
                  </pub:values>
                  </pub:item>
                  <pub:item>
                  <pub:name>P_FROM_DATE</pub:name>
                  <pub:values>
                      <pub:item>2021-01-01</pub:item>
                  </pub:values>
                  </pub:item>
            </pub:parameterNameValues>
            <pub:reportAbsolutePath>/Custom/Integration/Reports/SIS GL Wise Transaction Report.xdo</pub:reportAbsolutePath>
<!-- Setting sizeOfDataChunkDownload to -1 will return the output to the calling client -->
            <pub:sizeOfDataChunkDownload>-1</pub:sizeOfDataChunkDownload>
         </pub:reportRequest>
      </pub:runReport>
   </soap:Body>
</soap:Envelope>
